# програма-калькулятор теореми Піфагора

import math

# вивід інформації про програму
print("Програма-калькулятор теореми Піфагора.")
print("Ви можете обчислити гіпотенузу або катет, залежно від введених значень.")

# вибір операції
choice = input("Натисніть 'г' для обчислення гіпотенузи або 'к' для обчислення катету: ")

# обчислення гіпотенузи
if choice == "г":
    a = float(input("Введіть довжину першого катету: "))
    b = float(input("Введіть довжину другого катету: "))
    c = math.sqrt(a**2 + b**2)
    print("Довжина гіпотенузи: ", c)

# обчислення катету
elif choice == "к":
    c = float(input("Введіть довжину гіпотенузи: "))
    b = float(input("Введіть довжину одного з катетів: "))
    a = math.sqrt(c**2 - b**2)
    print("Довжина другого катету: ", a)

# вивід повідомлення про неправильний вибір
else:
    print("Виберіть операцію 'г' або 'к'.")
